{"Metacritic":[{"critic":"Digital Spy","score":"100","excerpt":"Three games' worth of classic heroes and villains and six years of work come together beautifully in a fitting conclusion to an epic superhero trilogy.","date":"2015-06-29","link":"http://www.digitalspy.com/gaming/review/a655363/batman-arkham-knight-review-the-open-world-game-gotham-deserves.html"},{"critic":"Impulsegamer","score":"100","excerpt":"Beautifully presented, slick gameplay and a storyline that in my books is better than the recent films, Batman Arkham Knight is a fitting way to end this franchise.","date":"2015-06-28","link":"http://www.impulsegamer.com/batman-arkham-knight-ps4-review/"},{"critic":"Twinfinite","score":"100","excerpt":"Amazing gameplay, stunning visuals, a deep narrative that takes Batman to a new darkness, and hands-down the best superhero video game in existence.","date":"2015-06-27","link":"http://www.twinfinite.net/2015/06/27/batman-arkham-knight-review/"},{"critic":"Guardian","score":"100","excerpt":"Arkham Knight triumphs as a richly empowering comic book fantasy that sees its hero fail almost as much as he succeeds, making him the most believable, the most occasionally unlikeable, and ultimately the most heroic he’s ever been.","date":"2015-06-25","link":"http://www.theguardian.com/technology/2015/jun/25/batman-arkham-knight-review-comic-book-fantasy"},{"critic":"Attack of the Fanboy","score":"100","excerpt":"Rocksteady Studios leaves Batman behind at the top of their game in terms of visual presentation, gameplay, and storytelling. While Arkham Knight's innovations are few, they are impactful and smart, and all work towards the common goal of giving the player the ultimate power fantasy of being the Batman.","date":"2015-06-22","link":"http://attackofthefanboy.com/news/batman-arkham-knight-review/"},{"critic":"AusGamers","score":"100","excerpt":"It’s the best-looking game across all three platforms (yes, even over The Witcher 3), but more importantly it just delivers in every aspect you could hope for. It’s challenging and engaging, expansive and enticing. Its game-world is wholly realised and gorgeous to look at, but above all else, it tells such an incredible story in so many new and unique ways, it’s impossible to ignore.","date":"2015-06-19","link":"http://www.ausgamers.com/games/batman-arkham-knight/review/"},{"critic":"VideoGamer","score":"100","excerpt":"It's epic; it's grand; it's addictive; it's ridiculously good-looking and it's going to be remembered for a long time to come. A masterpiece.","date":"2015-06-19","link":"http://www.videogamer.com/reviews/batman_arkham_knight_review.html"},{"critic":"God is a Geek","score":"100","excerpt":"Rocksteady have created one of the best comic-book games ever made.","date":"2015-06-19","link":"http://www.godisageek.com/reviews/batman-arkham-knight-review/"},{"critic":"Polygon","score":"100","excerpt":"After Arkham Knight, Batman has been perfected — and the end result is the best game of this console generation.","date":"2015-06-19","link":"http://www.polygon.com/2015/6/19/8811383/batman-arkham-knight-review-xbox-one-PC-PS4"},{"critic":"Canadian Online Gamers","score":"98","excerpt":"It’s the best Batman game you’ll play and by that measure, the best superhero game to date.","date":"2015-07-01","link":"http://canadianonlinegamers.com/review/batman-arkham-knight-review/"},{"critic":"LevelUp","score":"98","excerpt":"Rocksteady says farewell to the franchise with an utter masterpiece; its best game so far. Each element feels like a love letter to fans and to Batman himself. Batman: Arkham Knight is the perfect conclusion to an excellent saga, and it departs in the same way it once came: leaving us amazed and with great satisfaction.","date":"2015-06-24","link":"http://www.levelup.com/PlayStation-4/juegos/50031/Batman-Arkham-Knight/review"},{"critic":"Digital Chumps","score":"96","excerpt":"Rocksteady and WBIE have managed to capture lightning in a bottle three consecutive times with the Arkham series, with the most refined and focused strike being Arkham Knight.","date":"2015-06-30","link":"http://digitalchumps.com/game-reviews/352-playstation-4/arkhamknight-rv.html"},{"critic":"NZGamer","score":"96","excerpt":"A stunning climax to the series, and a worthy send-off to the team at Rocksteady.","date":"2015-06-28","link":"http://nzgamer.com/reviews/2298/batman-arkham-knight.html"},{"critic":"CGMagazine","score":"95","excerpt":"Arkham Knight is quite simply the Batman game that anyone who obsesses over the caped crusader always dreamed would exist.","date":"2015-07-02","link":"http://www.cgmagonline.com/reviews/batman-arkham-knight-ps4-review/"},{"critic":"XGN","score":"95","excerpt":"The best Batman game by far. Rocksteady has perfected the formula by offering a beautiful open world, more than twenty hours of main story and a broad number of diverse activities. This game really lets the franchise end with a bang.","date":"2015-06-25","link":"http://www.xgn.nl/review/batman-arkham-knight-review"},{"critic":"Multiplayer.it","score":"95","excerpt":"This is, for sure, the best chapter of the Rocksteady’s trilogy and if you’re a fan of Batman (but also if you’re not), you have to buy this game.","date":"2015-06-19","link":"http://multiplayer.it/recensioni/151805-batman-arkham-knight-lultima-notte-del-cavaliere-oscuro.html"},{"critic":"Hobby Consolas","score":"95","excerpt":"Batman and Rocksteay have achieved the impossible again, offering an amazing and unforgettable story and, at the same time, adding unique gameplay touches thanks to the perfect integration of the Batmobile. And all that wrapped in one of the most stunning and impressive technical showcases of the new consoles. A truly enjoyable ride that no fan of Batman should miss.","date":"2015-06-19","link":"http://www.hobbyconsolas.com/reviews/analisis-batman-arkham-knight-para-ps4-120088"},{"critic":"Game Informer","score":"95","excerpt":"Rocksteady built a special experience that dazzles with its cleverness, intelligence, and ability to shift from kick-ass Batman moments to emotional gut punches to scenes stripped straight from some of Batman's greatest comic book stories. Lock yourself away, avoid social media and friends, and finish this game. You won't want this one spoiled for you.","date":"2015-06-19","link":"http://www.gameinformer.com/games/batman_arkham_knight/b/playstation4/archive/2015/06/19/batman-arkham-knight-review-game-informer.aspx"},{"critic":"IGN Spain","score":"94","excerpt":"An excellent trilogy ending from a studio that has earned its reputation with the three quality games of this saga.","date":"2015-06-30","link":"http://es.ign.com/batman-arkham-knight-ps4/94551/review/batman-arkham-knight-analisis-para-ps4-y-xbox-one"},{"critic":"InsideGamer.nl","score":"93","excerpt":"Batman: Arkham Knight is a nearly perfect ending of an excellent series. The package feels complete with its interesting fighting system and many gadgets. The Batmobile and the strong story make things fresh and new, even though fights with the Batmobile could have been better. We hope Rocksteady is not done with the Dark Knight yet.","date":"2015-06-30","link":"http://www.insidegamer.nl/recensies/117693/batman-arkham-knight-review-angstwekkend-goed"},{"critic":"Atomix","score":"93","excerpt":"Batman Arkham Knight is the best entry in the series. Rocksteady knows perfectly how to explode the formula established years ago, making amazing additions in terms of gameplay. You must play this game.","date":"2015-06-24","link":"http://atomix.vg/2015/06/24/review-batman-arkham-knight/"},{"critic":"GamesVillage.it","score":"93","excerpt":"Batman: Arkham Knight is a great final chapter for the Rocksteady trilogy, and by far the best title in the series. Amazing storytelling, a solid, well-known yet still engaging gameplay, and a convincing open world are the highlights of a top-notch production. The monumental graphics are just the icing on the cake. Fans of the Caped Crusader, thou shall not miss this game.","date":"2015-06-23","link":"http://www.gamesvillage.it/videogiochi/recensioni/91684/batman-arkham-knight-recensione-review-ps4-xbox-one-pc/"},{"critic":"Meristation","score":"93","excerpt":"Rocksteady leaves us with a love letter to the fans.","date":"2015-06-19","link":"http://www.meristation.com/playstation-4/batman-arkham-knight/analisis-juego/1961330"},{"critic":"LaPS4","score":"92","excerpt":"Rocksteady knows what to do with Batman, and brings us another superb game. Batmobile's addition could have been better, as well as some moments with some of the Dark Knight's legendary foes. However, there's no other current-gen, open world action game as exciting as Batman: Arkham Knight.","date":"2015-06-29","link":"http://www.laps4.com/analisis/421483-analisis_batman_arkham_knight.html"},{"critic":"IGN","score":"92","excerpt":"The addition of tank combat thematically clashes with everything Batman stands for, but it is fun, and having access to the Batmobile for the first time gives us a new world of possibilities for interacting with Gotham City. Arkham Knight is an outstanding game on almost every level.","date":"2015-06-19","link":"http://www.ign.com/articles/2015/06/19/batman-arkham-knight-review"},{"critic":"Vandal Online","score":"91","excerpt":"A great game for one of the greatest gaming franchises based on superheroes. Batman: AK will surprise you from its beginning to its end in an adventure full of content and unforgettable moments.","date":"2015-06-27","link":"http://www.vandal.net/analisis/ps4/batman-arkham-knight/23612"},{"critic":"Playstation Official Magazine UK","score":"90","excerpt":"A technically brilliant superhero sandbox that empowers players like little else on PlayStation 4. [Aug 2015, p.85]","date":"2015-07-17","link":null},{"critic":"DarkStation","score":"90","excerpt":"Unlike Arkham Origins, which felt like the Arkham story’s unwelcomed little brother, Arkham Knight earns its position as the end of this triolgy. It goes out hard and fast, carrying one of comics most iconic characters into an unknown twilight, and leaving us with Rocksteady’s undisputed triumph over the licensed game space.","date":"2015-07-15","link":"http://www.darkstation.com/reviews/batman-arkham-knight/"},{"critic":"Game Rant","score":"90","excerpt":"It plays great, it looks great, and its story is better than many Hollywood blockbusters out there.","date":"2015-07-06","link":null},{"critic":"Playstation Universe","score":"90","excerpt":"Arkham Knight has some flaws, but they generally pale in comparison to the wondrous spectacle Rocksteady serves us up. A fine end to the Arkham trilogy.","date":"2015-07-02","link":"http://www.psu.com/review/27402/Batman--Arkham-Knight-Review"},{"critic":"ZTGD","score":"90","excerpt":"Batman: Arkham Knight may mark the end of Rocksteady’s trilogy, but it goes out with a bang. There is so much to love about it, it is easily in contention for one of the best of 2015.","date":"2015-07-01","link":"http://www.ztgd.com/batman-arkham-knight/review/"},{"critic":"Lazygamer","score":"90","excerpt":"Reinvigorated and ready for the ultimate fight to save Gotham City, Rocksteady's Batman is going out with the biggest of bangs in the definitive Dark Knight game.","date":"2015-07-01","link":"http://www.lazygamer.net/review/lazygamer-review/batman-arkham-knight-review-make-it-wayne/"},{"critic":"GamingTrend","score":"90","excerpt":"While the emphasis on the Batmobile late in the game can be incredibly tiring, the characters and world around you never stop propelling you forward. Combine that with the numerous upgrades for your weapons and plethora of side content available, and you have one hell of a Batman video game.","date":"2015-06-30","link":"http://gamingtrend.com/reviews/soaring-high-batman-arkham-knight-review/"},{"critic":"IGN Italia","score":"90","excerpt":"Despite a not-so-smooth introduction of the huge anticipated Batmobile, Arkham Knight is an amazing game, and one of the best examples of open world games so far. The way you can interact with Gotham is remarkable, and there’s so much love for the DC’s comics that you can feel it in every corner of the city. Goodbye Rocksteady, and thanks for all the bats.","date":"2015-06-30","link":"http://it.ign.com/batman-arkham-knight-ps4/98582/review/batman-arkham-knight-la-recensione"},{"critic":"GameTrailers","score":"90","excerpt":"Arkham Knight tells a mature story that cares about its characters. The missions are a little over-committed to showing how much the Batmobile can do, but it also feels like the car completes Rocksteady’s vision of a living, breathing Gotham City; a war zone with lots of problems to solve and lots of fun ways to solve them.","date":"2015-06-29","link":"http://www.gametrailers.com/reviews/6qil2t/batman--arkham-knight-review"},{"critic":"Post Arcade (National Post)","score":"90","excerpt":"It’s not perfect. There are moments of irritation, mostly during those Batmobile sequences. But when it’s firing on all cylinders – which is the bulk of the time – there’s just no other super hero game like it.","date":"2015-06-29","link":"http://business.financialpost.com/fp-tech-desk/post-arcade/batman-arkham-knight-review-all-bets-are-off-in-the-caped-crusaders-gritty-climactic-stylish-finale?__lsa=4f70-497c"},{"critic":"Eurogamer Poland","score":"90","excerpt":"The third Batman game from Rocksteady is an excellent title, undoubtedly the best in studio's history. It impresses not only with beautiful graphics and a dark city, but also due to a great selection of characters and brilliant storyline.","date":"2015-06-28","link":"http://www.eurogamer.pl/articles/2015-06-26-batman-arkham-knight-recenzja"},{"critic":"Arcade Sushi","score":"90","excerpt":"Arkham Knight is a massive technical achievement on consoles, and as a final note on the character and franchise, it delivers in almost every way.","date":"2015-06-26","link":"http://arcadesushi.com/batman-arkham-knight-review-playstation-4/"},{"critic":"PlayStation LifeStyle","score":"90","excerpt":"The thing to remember is that this will be Rocksteady Studios’ last entry into the Batman Arkham universe, so if you have been playing the previous entries in the series, and enjoyed them, this is going to be a no-brainer, just go get it.","date":"2015-06-26","link":"http://www.playstationlifestyle.net/2015/06/26/batman-arkham-knight-review-behind-mask-ps4/"},{"critic":"Dealspwn","score":"90","excerpt":"Rocksteady and Batman is a combination we'll sorely miss. Their trilogy ends on a high though, with a refinement of their excellent Freeflow combat and Predator modes. The Batmobile is a somewhat mixed experience, but its heart is in the right place. Our much-awaited tour of the city of Gotham was a gorgeous sight to behold and an unforgettable goodbye.","date":"2015-06-26","link":"http://www.dealspwn.com/batman-arkham-knight-review-217953"},{"critic":"PSX Extreme","score":"90","excerpt":"The technical aspects are not only eye-popping but they’re also quite stable. The graphics are slick, the sound is stellar, the control is rock solid, and the gameplay variety is downright tremendous. I love the blending of puzzle, stealth, action, and adventure, and you have to give mad crazy props to the overall game design. I still say the story could be less predictable (perhaps give the player a little more credit in terms of literary comprehension) and the Batmobile, as awesome as it can be, is just overdone.","date":"2015-06-25","link":"http://www.psxextreme.com/ps4-reviews/86.html"},{"critic":"Eurogamer Italy","score":"90","excerpt":"The definitive Batman experience and one of the best open world games of the new generation.","date":"2015-06-25","link":"http://www.eurogamer.it/articles/2015-06-25-batman-arkham-knight-conclusione-gloriosa-recensione"},{"critic":"Gamer.no","score":"90","excerpt":"Batman: Arkham Knight is the best game in a great series. Rocksteady continues to polish and improve a great combat system, with graphics and animations that have never looked better. A gripping, dark and perfectly Batman story with loads of great villains and heroes.","date":"2015-06-25","link":"http://www.gamer.no/artikler/anmeldelse-batman-arkham-knight/190985"},{"critic":"Gamer.nl","score":"90","excerpt":"Batman: Arkham Knight is not just the best Batman-game and the best comic book game ever, the game also has one of the most fun open worlds we've ever seen in videogame history. Rocksteady perfected its formula, but did take it a bit too far with the Batmobile.","date":"2015-06-24","link":"https://gamer.nl/articles/review/batman-arkham-knight/"},{"critic":"3DJuegos","score":"90","excerpt":"The amazing Rocksteady Arkham trilogy ends with this awesome game. Maybe the Batmobile is overused, but if you switch over the many gameplay experiences that the new Batman brings you will be less likely to get bored.","date":"2015-06-24","link":"http://www.3djuegos.com/juegos/analisis/18667/0/batman-arkham-knight/"},{"critic":"Digital Trends","score":"90","excerpt":"Developer Rocksteady reinvigorates its Arkham series formula with fresh gameplay features and an expansive open world in Batman: Arkham Knight.","date":"2015-06-23","link":"http://www.digitaltrends.com/game-reviews/batman-arkham-knight-review/"},{"critic":"Cheat Code Central","score":"90","excerpt":"Simply put, Batman: Arkham Knight is an awesome game for any fan of Batman, any fan of action games, and I would even say any fan that enjoys just good games.","date":"2015-06-22","link":"http://www.cheatcc.com/ps4/rev/batmanarkhamknightreview.html"},{"critic":"SpazioGames","score":"90","excerpt":"Quotation forthcoming.","date":"2015-06-20","link":"http://www.spaziogames.it/recensioni_videogiochi/console_multi_piattaforma/17948/batman-arkham-knight.aspx"},{"critic":"Toronto Sun","score":"90","excerpt":"Batman: Arkham Knight is a game that shows what can happen when a talented development studio is completely invested in a fictional universe and has mastered the technology to bring it to life. We’ve become the Batman before, but never quite like this.","date":"2015-06-20","link":"http://www.torontosun.com/2015/06/19/batman-arkham-knight-review-fantastic-if-a-little-formulaic"},{"critic":"Everyeye.it","score":"90","excerpt":"Despite the fact that the plot is less interesting than the one from the first chapter, and that the story lacks momentum in its first half, it's one hell of a ride, and it will make you feel like Batman once again.","date":"2015-06-19","link":"http://www.everyeye.it/articoli/recensione-batman-arkham-knight-26240.html"},{"critic":"Gameblog.fr","score":"90","excerpt":"With its gorgeous visuals, very entertaining storyline and nearly perfect gameplay, Batman: Arkham Knight is the best episode of this awesome franchise.","date":"2015-06-19","link":"http://www.gameblog.fr/tests/2243-batman-arkham-knight-ps4-xbox-one-pc"},{"critic":"games(TM)","score":"90","excerpt":"This is the best superhero fantasy we’ve ever enacted, and we’re so sad it’s over.","date":"2015-06-19","link":"http://www.gamestm.co.uk/reviews/batman-arkham-knight-review/"},{"critic":"PLAY! Zine","score":"85","excerpt":"The end of a trilogy the Batman Arkham series deserved. One of the most fun open world environments you’ll find in any game, mixed in with a good storyline and fun, but at times flawed gameplay.","date":"2015-07-03","link":"http://play.co.rs/2015/07/review-batman-arkham-knight/"},{"critic":"PSX-Sense.nl","score":"85","excerpt":"Unfortunately, the game's most important addition is also its greatest weakness: the first couple of hours in the Batmobile are exhilarating, but the constant emphasis on this clunky vehicle keeps Arkham Knight from reaching its predecessors' heights. Nevertheless, this is one hell of a Batman simuator that's very worth experiencing.","date":"2015-07-01","link":"http://www.psx-sense.nl/196401/review-batman-arkham-knight/"},{"critic":"Worth Playing","score":"85","excerpt":"The improved combat and predator systems are worth the cost of entry, and a lot of the core combat mechanics are still the best in the genre. Unfortunately, it's held back by a somewhat weak Batmobile mechanic and a lackluster plot.","date":"2015-06-26","link":"http://worthplaying.com/article/2015/6/26/reviews/96358/"},{"critic":"Merlin'in Kazanı (Turkey)","score":"85","excerpt":"Arkham Knight is the best looking Batman game ever. Gotham is a massive world to explore and there are lots of side quest to complete. However Batmobile sequences are too frequent and campaign quests are forcing you to use it.","date":"2015-06-24","link":"http://www.merlininkazani.com/Batman_Arkham_Knight-oyun_inceleme-82450p1.html"},{"critic":"GRYOnline.pl","score":"85","excerpt":"Batman: Arkham Knight is a great ending to a terrific trilogy created with one simple rule in mind: if it's not broken, don't fix it. The game may be missing some of its gothic atmosphere and there are far too many batmobile vs tanks sequences but a well known gameplay formula does the trick again. My meeting with the Arkham Knight was extremely enjoyable.","date":"2015-06-19","link":"http://www.gry-online.pl/S020.asp?ID=10537"},{"critic":"Edge Magazine","score":"80","excerpt":"Its biggest adventure to date isn't flawless, but the Dark Knight is far from one to underestimate. [Aug 2015, p.106]","date":"2015-07-17","link":null},{"critic":"Telegraph","score":"80","excerpt":"Knight, for all its foibles and frustrations, consistently gives you that injection of adrenaline.","date":"2015-07-16","link":"http://www.telegraph.co.uk/technology/video-games/video-game-reviews/11741486/Batman-Arkham-Knight-review.html"},{"critic":"Games.cz","score":"80","excerpt":"The attempt to diversify Batman's universe by using a controllable Batmobile paradoxically hurts the game by adding too exaggerated arcade action in it. In addition, the creators failed to find a sufficiently strong duo of bad guys after the Joker's death. Nevertheless, Arkham Knight is a dignified farewell to Gotham and an almost perfect action-adventure.","date":"2015-07-08","link":"http://games.tiscali.cz/recenze/batman-arkham-knight-recenze-ps4-verze-253021"},{"critic":"Hyper Magazine","score":"80","excerpt":"Arkham Knight is certainly a bigger, and in many ways a better game than its predecessors, but those attempts to make it ‘more badass’ do more harm than good. Even so, any frustrations I have with Arkham Knight don’t take away from the fact that I was unable to stop playing for four days straight, frequently in awe. It’s a stunning achievement in many ways, a game of ridiculous polish and obvious effort, and its best moments are good enough to make the worst moments worth bearing.","date":"2015-07-07","link":"http://www.pcauthority.com.au/Review/406191,review-batman-arkham-knight.aspx"},{"critic":"Quarter to Three","score":"80","excerpt":"Arkham Knight’s take on the hero/villain relationship is unique. You can hail it as clever as Fight Club or dismiss it as stupid as midichlorians — you’re at least a little right on either count — but you cannot deny that it’s a compelling variation on the theme, and it works wonders to sustain the story with unique dialogue and narrative opportunities.","date":"2015-07-03","link":"http://www.quartertothree.com/fp/2015/07/03/arkham-knights-one-dark-night-of-chaos-control-and-capes/"},{"critic":"Gamestyle","score":"80","excerpt":"The combat is as good as it’s ever been, the writing is sharp, it’s visually stunning, and the game is full of iconic Batman moments that fans will adore and talk about for years to come. Don’t let the game’s few – admittedly glaring – flaws deter you from what is otherwise a terrific Batman tale.","date":"2015-07-03","link":"http://gamestyle.com/review/batman-arkham-knight-review/"},{"critic":"Washington Post","score":"80","excerpt":"Pretty much from the opening cutscene onwards the game roused the old comic book aficionado in me, leaving me to wonder what sort of tizzy the game would have sent me into when I was thirteen or fourteen.","date":"2015-06-30","link":"https://www.washingtonpost.com/news/comic-riffs/wp/2015/06/30/batman-arkham-knight-review-a-game-worthy-of-the-comic-books-legacy/"},{"critic":"Digitally Downloaded","score":"80","excerpt":"Despite some questionable use of characters, the narrative in Batman: Arkam Knight is engrossing. The city of Gotham is appropriately sprawling with a great deal to do. Combat is smooth and fluid, even if driving the Batmobile is not, and there are several good hooks for progressing Batman's character that reward you for the time invested in the game.","date":"2015-06-30","link":"http://www.digitallydownloaded.net/2015/06/review-batman-arkham-knight-sony.html"},{"critic":"Game Revolution","score":"80","excerpt":"It's a shame the game focuses so much on the Batmobile, because even that provides a welcome change of pace in small doses. Unfortunately, Arkham Knight doesn't deliver the Batmobile in small doses, and it turns out to be the most intrusive part of the experience.","date":"2015-06-29","link":"http://www.gamerevolution.com/review/batman-arkham-knight"},{"critic":"Slant Magazine","score":"80","excerpt":"Even with all the gadgets, all the training, all the exhilaration of success, Arkham Knight's greatest achievement is in making it feel like it just might not be enough.","date":"2015-06-28","link":"http://www.slantmagazine.com/games/review/batman-arkham-knight"},{"critic":"Hardcore Gamer","score":"80","excerpt":"A dense and enthralling action-adventure game with a winding, if predictable, story that does make you feel like the Batman both inside and outside the Batmobile. There are too many Batmobile gameplay segments, however, making this predominantly similar in theme to that Batmobile-focused Batman arcade game.","date":"2015-06-28","link":"http://www.hardcoregamer.com/2015/06/28/review-batman-arkham-knight/156433/"},{"critic":"Push Square","score":"80","excerpt":"It's a superior game that plays brilliantly, and certainly stands in a league of its own in the Arkham line-up for the most part, but it simply doesn't leave your jaw agape like Arkham City seemed to manage with such ease and finesse.","date":"2015-06-28","link":"http://www.pushsquare.com/reviews/ps4/batman_arkham_knight"},{"critic":"Giant Bomb","score":"80","excerpt":"Arkham Knight sees Rocksteady becoming more confident in its design within the larger scope of an entire city, and despite a few uneven spots, this is overall a satisfying way to wrap up what the developer has referred to as its trilogy of Arkham games.","date":"2015-06-27","link":"http://www.giantbomb.com/reviews/batman-arkham-knight-review/1900-702/"},{"critic":"TheSixthAxis","score":"80","excerpt":"Batman: Arkham Knight is bigger and bolder than its predecessors, but it’s not better. The plot has some good twists and the exploration of Batman’s character is well done, but overall it doesn’t draw you in like the events of Asylum and City.","date":"2015-06-25","link":"http://www.thesixthaxis.com/2015/06/25/batman-arkham-knight-review/"},{"critic":"JeuxActu","score":"80","excerpt":"Batman Arkham Knight is not as good as Rocksteady would have wished. The open world makes it difficult to keep the rhythm, and the all-around use of the Batmobile gets tiresome in the end. Despite this few problems, the software ends up as a nice game.","date":"2015-06-22","link":"http://www.jeuxactu.com/test-batman-arkham-knight-sur-ps4-et-xbox-one-99310.htm"},{"critic":"USgamer","score":"80","excerpt":"Rocksteady absolutely nailed the feeling of being Batman and Arkham Knight only increases the scope of the original games. Yes, I got annoyed, but the moment-to-moment play of Batman: Arkham Knight is still amazing. If you've saved the Asylum and cleaned up the City, it's worth finishing the Knight off.","date":"2015-06-19","link":"http://www.usgamer.net/articles/batman-arkham-knight-ps4-review-knightfall-is-coming"},{"critic":"GamesRadar+","score":"80","excerpt":"An ambitious and successful end to Rocksteady’s trilogy, with a standard-setting open world you must experience. A superior main story and less Batmobile combat would’ve made a huge difference.","date":"2015-06-19","link":"http://www.gamesradar.com/batman-arkham-knight-review/"},{"critic":"ActionTrip","score":"79","excerpt":"Sorry guys, you really nailed the atmosphere, but at the end of the day you left us with an overload of tanks, repetitive missions, and a story that’s okay, but just felt it could’ve been so much more.","date":"2015-07-05","link":"http://www.actiontrip.com/reviews/ps4/batman-arkham-knight.phtml"},{"critic":"Riot Pixels","score":"75","excerpt":"It’s a spectacular summer blockbuster, and it keeps you entertained until you notice that as far as creativity goes, it’s been running on fumes the whole time.","date":"2015-07-16","link":"http://riotpixels.com/batman-arkham-knight-review/"},{"critic":"Destructoid","score":"70","excerpt":"Arkham Knight is a solid, if uneven send-off for Rocksteady's trilogy. Combat and predation are still satisfying. The narrative mixes unsurprising, but well done segments with unsurprising and uninteresting elements. It's full of nods, winks, nudges for batfans, even if certain super villain side missions feel needlessly tossed in.","date":"2015-06-25","link":"http://www.destructoid.com/review-batman-arkham-knight-294804.phtml"},{"critic":"Metro GameCentral","score":"70","excerpt":"Less consistent than the previous games, and the Batmobile is a surprisingly unwelcome addition, but even as the worst of the Arkham titles this is still a superior superhero adventure.","date":"2015-06-24","link":"http://metro.co.uk/2015/06/24/batman-arkham-knight-review-car-trouble-5262419/"},{"critic":"GameSpot","score":"70","excerpt":"Arkham Knight is constantly trying to justify the Batmobile's presence, forcing it upon you at nearly every opportunity.","date":"2015-06-19","link":"http://www.gamespot.com/reviews/batman-arkham-knight-review/1900-6416169/"},{"critic":"4Players.de","score":"67","excerpt":"Gotham City looks astonishing while the story is full of suspense and surprises. Mechanically the star once again is the freeflow fighting system. But somewhere along the way Rocksteady lost the focus and missed the point, especially with the overpowering, omnipresent inclusion of the Batmobile. Those sequences (and there are far too many) are nothing but a second-tier shooter which takes away too much from the dark knight and everything he stood for up to now.","date":"2015-07-03","link":"http://www.4players.de/4players.php/dispbericht/PlayStation4/Test/35541/81194/0/Batman_Arkham_Knight.html"},{"critic":"Kill Screen","score":"65","excerpt":"Arkham Knight is distressingly inorganic. Continuing the predictable trend the franchise, the game learns the wrong lessons from its predecessors.","date":"2015-07-03","link":"http://killscreendaily.com/articles/shiny-pricy-world-batman-arkham-knight/"}],"Youtube":[{"videoId":"buB5pI5w61w","title":"Batman: Arkham Knight Angry Review *Spoilers*","description":"\"Baymang\" Joe and \"OtherSuperJoe\" FINALLY Review the conclusion to the Arkham Trilogy, Batman: Arkham Knight! What took so long? and how does this ...","image":{"default":"https://i.ytimg.com/vi/buB5pI5w61w/default.jpg","medium":"https://i.ytimg.com/vi/buB5pI5w61w/mqdefault.jpg","high":"https://i.ytimg.com/vi/buB5pI5w61w/hqdefault.jpg"}},{"videoId":"tl39XPeb7UE","title":"Batman: Arkham Knight - Video Review","description":"Batman: Arkham Knight is an impressive game on almost every level, with non-stop variety and great action.","image":{"default":"https://i.ytimg.com/vi/tl39XPeb7UE/default.jpg","medium":"https://i.ytimg.com/vi/tl39XPeb7UE/mqdefault.jpg","high":"https://i.ytimg.com/vi/tl39XPeb7UE/hqdefault.jpg"}},{"videoId":"k1xnre-sIWI","title":"Batman: Arkham Knight - Review","description":"Kevin finds Arkham Knight to be another slick and enjoyable Batman adventure, though what it brings to the series' table is not always for the best. Read Kevin's ...","image":{"default":"https://i.ytimg.com/vi/k1xnre-sIWI/default.jpg","medium":"https://i.ytimg.com/vi/k1xnre-sIWI/mqdefault.jpg","high":"https://i.ytimg.com/vi/k1xnre-sIWI/hqdefault.jpg"}},{"videoId":"lssMmhoGuo8","title":"Batman Arkham Knight Review (PS4, no spoilers)","description":"Batman: Arkham Knight review, done on the PS4 with no spoilers. Words can be read here: http://www.videogamer.com/reviews/batman_arkham_knight_review.html.","image":{"default":"https://i.ytimg.com/vi/lssMmhoGuo8/default.jpg","medium":"https://i.ytimg.com/vi/lssMmhoGuo8/mqdefault.jpg","high":"https://i.ytimg.com/vi/lssMmhoGuo8/hqdefault.jpg"}},{"videoId":"ecAYnfHRs0k","title":"Batman: Arkham Knight - Game Review","description":"Please visit this link and use the coupon code STUCKMANN at checkout: http://hrys.co/1J0YRxY FACEBOOK: https://www.facebook.com/ChrisStuckmann ...","image":{"default":"https://i.ytimg.com/vi/ecAYnfHRs0k/default.jpg","medium":"https://i.ytimg.com/vi/ecAYnfHRs0k/mqdefault.jpg","high":"https://i.ytimg.com/vi/ecAYnfHRs0k/hqdefault.jpg"}},{"videoId":"MrDAsynx7Gk","title":"Official Batman Arkham Knight Review (Spoiler Free)","description":"Karak takes Batman Arkham Knight for a spin to review it for the Xbox One, Ps4, and PC. Gameplay Xbox One Time spent 80% Xbox One, 10% PS4, 10% PC Do ...","image":{"default":"https://i.ytimg.com/vi/MrDAsynx7Gk/default.jpg","medium":"https://i.ytimg.com/vi/MrDAsynx7Gk/mqdefault.jpg","high":"https://i.ytimg.com/vi/MrDAsynx7Gk/hqdefault.jpg"}},{"videoId":"sQjF2CBlPlA","title":"Batman: Arkham Knight | Black Guy Reviews","description":"My thoughts on the latest Arkham game My Vine - https://vine.co/u/1227129487729819648 My Site - http://GamingIlluminaughty.com Live Streams ...","image":{"default":"https://i.ytimg.com/vi/sQjF2CBlPlA/default.jpg","medium":"https://i.ytimg.com/vi/sQjF2CBlPlA/mqdefault.jpg","high":"https://i.ytimg.com/vi/sQjF2CBlPlA/hqdefault.jpg"}},{"videoId":"7JP4aFinXQE","title":"Batman: Arkham Knight Review","description":"It's time for one of the biggest reviews of the year. But has all the new Batmobile action negatively impacted the Arkham experience? Read the full review at ...","image":{"default":"https://i.ytimg.com/vi/7JP4aFinXQE/default.jpg","medium":"https://i.ytimg.com/vi/7JP4aFinXQE/mqdefault.jpg","high":"https://i.ytimg.com/vi/7JP4aFinXQE/hqdefault.jpg"}},{"videoId":"gh6uorv8vpU","title":"Batman: Arkham Knight - Review","description":"The Batmobile leads the new improvements to the Arkham franchise. Does the latest threat to Gotham City give us a night to remember or is it time for the series ...","image":{"default":"https://i.ytimg.com/vi/gh6uorv8vpU/default.jpg","medium":"https://i.ytimg.com/vi/gh6uorv8vpU/mqdefault.jpg","high":"https://i.ytimg.com/vi/gh6uorv8vpU/hqdefault.jpg"}},{"videoId":"IsMtN_xvSuU","title":"Batman: Arkham Knight - game review","description":"Rocksteady's Batman Arkham trilogy comes to a close! Does the final chapter hold up to its predecessors? Jeremy reviews \"Batman: Arkham Knight! See more ...","image":{"default":"https://i.ytimg.com/vi/IsMtN_xvSuU/default.jpg","medium":"https://i.ytimg.com/vi/IsMtN_xvSuU/mqdefault.jpg","high":"https://i.ytimg.com/vi/IsMtN_xvSuU/hqdefault.jpg"}}],"Twitch":[{"stream_id":15422330416,"game":"Dota 2","viewers":13797,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_beyondthesummit-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_beyondthesummit-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_beyondthesummit-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_beyondthesummit-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/beyondthesummit"}},{"stream_id":15422551872,"game":"Dota 2","viewers":8696,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_starladder1-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_starladder1-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_starladder1-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_starladder1-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/starladder1"}},{"stream_id":15422895536,"game":"Dota 2","viewers":5413,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_w33haa-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_w33haa-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_w33haa-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_w33haa-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/w33haa"}},{"stream_id":15422684944,"game":"Dota 2","viewers":4587,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_a1taoda-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_a1taoda-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_a1taoda-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_a1taoda-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/a1taoda"}},{"stream_id":15420937888,"game":"Dota 2","viewers":837,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bananaslamjamma-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bananaslamjamma-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bananaslamjamma-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bananaslamjamma-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/bananaslamjamma"}},{"stream_id":15423017520,"game":"Dota 2","viewers":482,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_halejujah-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_halejujah-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_halejujah-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_halejujah-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/halejujah"}},{"stream_id":15421680336,"game":"Dota 2","viewers":242,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bonnieivse-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bonnieivse-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bonnieivse-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_bonnieivse-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/bonnieivse"}},{"stream_id":15422631472,"game":"Dota 2","viewers":239,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_gamerstudiotv-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_gamerstudiotv-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_gamerstudiotv-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_gamerstudiotv-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/gamerstudiotv"}},{"stream_id":15419695664,"game":"Dota 2","viewers":211,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_aliastar-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_aliastar-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_aliastar-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_aliastar-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/aliastar"}},{"stream_id":15422727296,"game":"Dota 2","viewers":114,"preview":{"small":"http://static-cdn.jtvnw.net/previews-ttv/live_user_inozemec-80x45.jpg","medium":"http://static-cdn.jtvnw.net/previews-ttv/live_user_inozemec-320x180.jpg","large":"http://static-cdn.jtvnw.net/previews-ttv/live_user_inozemec-640x360.jpg","template":"http://static-cdn.jtvnw.net/previews-ttv/live_user_inozemec-{width}x{height}.jpg"},"links":{"self":"https://api.twitch.tv/kraken/streams/inozemec"}}]}